Tekla Open API Reference for Tekla Structures 2025
Line Constructor (ViewBase, Point, Point, Double, Line.LineAttributes)
 Creates a new line instance with two points and a bulge using the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line(
	ViewBase view,
	Point startPoint,
	Point endPoint,
	double bulge,
	Line.LineAttributes attributes
)
Public Sub New (
	view As ViewBase,
	startPoint As Point,
	endPoint As Point,
	bulge As Double,
	attributes As Line.LineAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
startPoint
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
endPoint
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
bulge
Type: System.Double
The bulge to be used.
attributes
Type: Tekla.Structures.Drawing.Line.LineAttributes
The line attributes to be used.
See Also
Reference
Line Class
Line Overload
Tekla.Structures.Drawing Namespace